# 高级特性

#---------------------------------------------------切片----------------------------------------------------------------------------------------------------
l = list(range(100))
print(l)
print(l[:10])  #前10个数 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
print(l[10:20]) #前11-20个数 [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
print(l[-10:]) #后10个数： [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]
print(l[:10:2]) #前10个数，每两个取一个：[0, 2, 4, 6, 8]
print(l[::5])   #所有数，每5个取一个：[0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95]

#利用切片操作，实现一个trim()函数，去除字符串首尾的空格，注意不要调用str的strip()方法：
def trim(str):
    if str == None or len(str) ==0:
        return str
    elif str[0] == " ":
        return trim(str[1:])
    elif str[-1] == " ":
        return trim(str[:-1])
    else:
         return str
#测试
if trim('hello  ') != 'hello':
    print('测试失败!')
elif trim('  hello') != 'hello':
    print('测试失败!')
elif trim('  hello  ') != 'hello':
    print('测试失败!')
elif trim('  hello  world  ') != 'hello  world':
    print('测试失败!')
elif trim('') != '':
    print('测试失败!')
elif trim('    ') != '':
    print('测试失败!')
else:
    print('测试成功!')
#---------------------------------------------------迭代----------------------------------------------------------------------------------------------------
from collections import Iterable
isinstance("str",Iterable); #判断是否可以迭代

#使用迭代查找一个list中最小和最大值，并返回一个tuple：
def findMinAndMax(l):
    if l == []:
        return None, None
    maxNum = l[0] ;
    minNum = l[0];
    for n in l :
        if n > maxNum :
            maxNum = n ;
        elif n < minNum :
            minNum = n ;
    return minNum,maxNum
if findMinAndMax([]) != (None, None):
    print('测试失败!')
elif findMinAndMax([7]) != (7, 7):
    print('测试失败!')
elif findMinAndMax([7, 1]) != (1, 7):
    print('测试失败!')
elif findMinAndMax([7, 1, 3, 9, 5]) != (1, 9):
    print('测试失败!')
else:
    print('测试成功!')

#---------------------------------------------------列表生成式----------------------------------------------------------------------------------------------------
#请使用列表生成式，修改成小写
L1 = ['Hello', 'World', 18, 'Apple', None]
L2 = [s.lower() for s in L1 if isinstance(s,str)]
print(L2)

#---------------------------------------------------生成器----------------------------------------------------------------------------------------------------




#---------------------------------------------------迭代器----------------------------------------------------------------------------------------------------

